Namespace Docs.Enums

    Public Enum FileCaseStep
        بدوی = 0  'بدوی
        تجدید = 1  'تجدید نظر
        مقابل = 2 'دعوی مقابل
        جلب = 3   'دعوی جلب ثالث
        اعاده = 4  'درخواست اعاده
        ورود = 5   'دعوی ورود ثالث 
        اعتراض = 6  ' دعوی اعتراض ثالث
        فرجام = 7   ' فرجام
        احکام = 8   'اجرای احکام
        دادسرا = 9
        واخواهی = 10

        ''''انتقال فایلها

        حقوقی = 20

        کیفری = 21

        همه = 22



    End Enum

    Public Enum FileCaseCat
        عادی = 0
        تسخیری = 1
        معاضدتی = 2

    End Enum

    Public Enum FileCaseComplainant
        خواهان = 0

        خوانده = 1

    End Enum

    Public Enum FileCaseType

        حقوقی = 0
        کیفری = 1

    End Enum

    'مربوط به جدول Files
    Public Enum FileType

        فایل = 0

        پرونده = 1

        محتویات_پرونده = 2

        پرونده_قفل_شده = 3

        پرونده_مختومه = 4

        مشخصات_پرونده = 5

        دایرکتوری_اوراق = 6

        محتویات_اوراق = 7

        دایرکتوری_مستندات = 8

        محتویات_مستندات = 9

        دایرکتوری_متفرقه = 10

        محتویات_متفرقه = 11

        آلارم = 12

        مالی = 13

        تجمیع_پرونده = 14

        محتویات_فایل = 15

        مشاوره = 16

        تعیین_موضوع = 17

        آرشیو_فایل = 18

    End Enum

End Namespace

